#### OpenTofu Format and Style 🖌`success`
#### OpenTofu Initialization ⚙️`success`
#### OpenTofu Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.

```

</details>

#### OpenTofu Plan 📖`success`

<details><summary>Show Plan</summary>

```

tofu
data.azurerm_client_config.current: Reading...
azurerm_resource_group.equalvote: Refreshing state... [id=/subscriptions/86f3145a-48cc-4255-8757-dd3104d15e57/resourceGroups/equalvote]
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0xMDZmYTU2Ny1lZjBmLTQxNzYtYWY4MS0zZjJhZjcwNmZhMjA7b2JqZWN0SWQ9ZTQ1MzZmMDctOGY1YS00NTAxLWJlOTAtNmEzZDJhMDliMGYzO3N1YnNjcmlwdGlvbklkPTg2ZjMxNDVhLTQ4Y2MtNDI1NS04NzU3LWRkMzEwNGQxNWU1Nzt0ZW5hbnRJZD1mYjViMDlkMC02YzdjLTRiZjItYWRmNy02ZmI2MWY5MDJkZTk=]
azurerm_data_protection_backup_vault.equalvote: Refreshing state... [id=/subscriptions/86f3145a-48cc-4255-8757-dd3104d15e57/resourceGroups/equalvote/providers/Microsoft.DataProtection/backupVaults/equalvote-backup-vault]
azurerm_virtual_network.equalvote: Refreshing state... [id=/subscriptions/86f3145a-48cc-4255-8757-dd3104d15e57/resourceGroups/equalvote/providers/Microsoft.Network/virtualNetworks/equalvote]
azurerm_dns_zone.dev: Refreshing state... [id=/subscriptions/86f3145a-48cc-4255-8757-dd3104d15e57/resourceGroups/equalvote/providers/Microsoft.Network/dnsZones/dev.equal.vote]
azurerm_user_assigned_identity.argocd-identity: Refreshing state... [id=/subscriptions/86f3145a-48cc-4255-8757-dd3104d15e57/resourceGroups/equalvote/providers/Microsoft.ManagedIdentity/userAssignedIdentities/argocd]
azurerm_dns_zone.prod: Refreshing state... [id=/subscriptions/86f3145a-48cc-4255-8757-dd3104d15e57/resourceGroups/equalvote/providers/Microsoft.Network/dnsZones/prod.equal.vote]
azurerm_dns_zone.sandbox: Refreshing state... [id=/subscriptions/86f3145a-48cc-4255-8757-dd3104d15e57/resourceGroups/equalvote/providers/Microsoft.Network/dnsZones/sandbox.star.vote]
azurerm_key_vault.equalvote-argocd: Refreshing state... [id=/subscriptions/86f3145a-48cc-4255-8757-dd3104d15e57/resourceGroups/equalvote/providers/Microsoft.KeyVault/vaults/equalvote-argocd]
azurerm_key_vault.equalvote: Refreshing state... [id=/subscriptions/86f3145a-48cc-4255-8757-dd3104d15e57/resourceGroups/equalvote/providers/Microsoft.KeyVault/vaults/equalvote]
azurerm_kubernetes_cluster.equalvote: Refreshing state... [id=/subscriptions/86f3145a-48cc-4255-8757-dd3104d15e57/resourceGroups/equalvote/providers/Microsoft.ContainerService/managedClusters/equalvote]
azurerm_storage_account.storage: Refreshing state... [id=/subscriptions/86f3145a-48cc-4255-8757-dd3104d15e57/resourceGroups/equalvote/providers/Microsoft.Storage/storageAccounts/bettervoting]
azurerm_data_protection_backup_policy_disk.equalvote: Refreshing state... [id=/subscriptions/86f3145a-48cc-4255-8757-dd3104d15e57/resourceGroups/equalvote/providers/Microsoft.DataProtection/backupVaults/equalvote-backup-vault/backupPolicies/equalvote-backup-policy]
azurerm_subnet.equalvote: Refreshing state... [id=/subscriptions/86f3145a-48cc-4255-8757-dd3104d15e57/resourceGroups/equalvote/providers/Microsoft.Network/virtualNetworks/equalvote/subnets/equalvote]
azurerm_key_vault_key.sops: Refreshing state... [id=https://equalvote.vault.azure.net/keys/sops/92a0fe05a77b4a3787d10bbd444f19c6]
azurerm_key_vault_access_policy.argocd-policy: Refreshing state... [id=/subscriptions/86f3145a-48cc-4255-8757-dd3104d15e57/resourceGroups/equalvote/providers/Microsoft.KeyVault/vaults/equalvote-argocd/objectId/2c7d3739-7134-4112-ae3d-8e3fd181032d]
azurerm_key_vault_key.sops-key: Refreshing state... [id=https://equalvote-argocd.vault.azure.net/keys/sops-key/9d7a971e677f4d8a9f2f7adaf349f7ff]
azurerm_federated_identity_credential.kubernetes-federated-credential: Refreshing state... [id=/subscriptions/86f3145a-48cc-4255-8757-dd3104d15e57/resourceGroups/equalvote/providers/Microsoft.ManagedIdentity/userAssignedIdentities/argocd/federatedIdentityCredentials/kubernetes-federated-credential]
azurerm_storage_container.candidate-photos: Refreshing state... [id=/subscriptions/86f3145a-48cc-4255-8757-dd3104d15e57/resourceGroups/equalvote/providers/Microsoft.Storage/storageAccounts/bettervoting/blobServices/default/containers/candidate-photos]

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu will perform the following actions:

  # azurerm_kubernetes_cluster_node_pool.green will be created
  + resource "azurerm_kubernetes_cluster_node_pool" "green" {
      + id                    = (known after apply)
      + kubelet_disk_type     = (known after apply)
      + kubernetes_cluster_id = "/subscriptions/86f3145a-48cc-4255-8757-dd3104d15e57/resourceGroups/equalvote/providers/Microsoft.ContainerService/managedClusters/equalvote"
      + max_pods              = (known after apply)
      + mode                  = "User"
      + name                  = "green"
      + node_count            = 1
      + node_labels           = (known after apply)
      + orchestrator_version  = (known after apply)
      + os_disk_size_gb       = (known after apply)
      + os_disk_type          = "Managed"
      + os_sku                = (known after apply)
      + os_type               = "Linux"
      + priority              = "Regular"
      + scale_down_mode       = "Delete"
      + spot_max_price        = -1
      + ultra_ssd_enabled     = false
      + vm_size               = "Standard_B2ps_v2"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.file

To perform exactly these actions, run the following command to apply:
    tofu apply "plan.file"

```

</details>

*Pusher: @3uzbcqje, Action: `pull_request`, Working Directory: ``, Workflow: `.github/workflows/opentofu.yml`*